<a href="https://colab.research.google.com/github/bhargavdhanisetti/AIML_NEOSKILLZ/blob/main/day_9_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#CREATE TABLE students (
#id INT PRIMARY KEY,
#name VARCHAR(60),
#marks INT,
#City VARCHAR(50)
#);

#INSERT INTO students VALUES
#(1, ‘Atharv’, 70, ‘Mumbai’)
#(2, ‘Dhanraj’,89, ‘Sangli’)
#(3, ‘Shreya’, 85, ‘Thiruvananthapuram’)
#(4,’Laxmi’,45, ‘Delhi’)
#(5, ‘Harshika’, 99, ‘Mysore’);

#CREATE TABLE city_info(
#City VARCHAR(50),
#State VARCHAR(50),
#Pin code INT
#);

#INSERT INTO city_info VALUES
#('Mumbai', 'Maharashtra', 400067),
#('Sangli', 'Maharashtra', 416406),
#('Thiruvananthapuram', 'Kerala', 695001),
#('Mumbai', 'Maharashtra', 400031),
#('Mysore', 'Karnataka', 570002),
#('Pune', 'Maharashtra', 400000),
#('Delhi', 'Delhi', 500000),
#('Ahmedabad', 'Gujarat',306780);

#SELECT * FROM students;
#SELECT * FROM city_info;

#select s.name,s.city,s.marks,c. Pincode
#from students s
#LEFT JOIN city_info c ON s.city = c.city;